Revit 2027 API
IFailuresProcessor.Dismiss Method
 This method is being called in case of exception or document destruction to dismiss any possible pending failure UI that may have left on the screen
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void Dismiss(
	Document document
)
Sub Dismiss (
	document As Document
)
void Dismiss(
	Document^ document
)
abstract Dismiss :
        document : Document -> unit
Parameters
document Document
 Document for which pending failures processing UI should be dismissed
See Also
Reference
IFailuresProcessor Interface
Autodesk.Revit.DB Namespace